In [1]:
import pandas as pd

In [2]:
# 열이름을 key, 리스트를 value로 갖는 딕셔너리의 정의 (2차원 배열)
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 
             'c3':[10,11,12], 'c4':[13,14,15]}
df = pd.DataFrame(dict_data)
print(type(df))
print(df)

<class 'pandas.core.frame.DataFrame'>
   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [5]:
# 리스트에 행인덱스 열 이름을 지정하여 데이터 프레임 만들기
df = pd.DataFrame([[15, '남', '신촌중'],[17, '여', '연세중']],
                 index=['준서', '예은'],
                 columns=['나이', '성별', '학교'])
#행 인덱스, 열이름 확인하기
print(df)
print(df.index) # 인덱스 이름
print(df.columns) # 열 이름

    나이 성별   학교
준서  15  남  신촌중
예은  17  여  연세중
Index(['준서', '예은'], dtype='object')
Index(['나이', '성별', '학교'], dtype='object')

In [7]:
df.columns = ['연령', '남여', '소속']

In [9]:
df.index = ['학생1', '학생2']

In [10]:
df

     연령 남여   소속
학생1  15  남  신촌중
학생2  17  여  연세중

In [11]:
#메소드를 사용해서 행과 열이름 변경
df = pd.DataFrame([[15, '남', '신촌중'],[17, '여', '연세중']],
                 index=['준서', '예은'],
                 columns=['나이', '성별', '학교'])
df.rename(columns={'나이':'연령', '성별':'남여',
                  '학교':'소속'}, inplace=True)

In [14]:
df.rename(index={'준서':'학생1', '예은':'학생2'}, inplace=True)

In [15]:
df

     연령 남여   소속
학생1  15  남  신촌중
학생2  17  여  연세중

In [20]:
# 데이터프레임 생성
data = {'국어':[80, 90, 70, 30], '영어':[90, 70, 60, 40],
        '수학':[90, 60, 80, 70]}
# 춘향, 몽룡, 향단, 방자
df = pd.DataFrame(data, index=["춘향", "몽룡", "향단", "방자"])
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [22]:
# indexing으로 몽룡의 국어점수 뽑아보기 
df['국어']['몽룡'] #열이 먼저 선택, 그 이후 인덱스 선택

90

In [24]:
# numpy random.randint를 사용해서 60~100 사이 12개 숫자를 만들고 
# reshape하고 index가 James, maria, brian, alice를 만들고
# 컬럼이름은 kor, eng, math로 된 데이터 프레임을 생성하기
import numpy as np
np.random.seed(2023)
df = pd.DataFrame(np.random.randint(60, 100, 12).reshape(4,3),
                 index=['James', 'maria', 'brian', 'alice'],
                 columns=['kor', 'eng', 'math'])
df

       kor  eng  math
James   83   85    66
maria   93   88    63
brian   82   97    92
alice   82   77    73

In [25]:
%%writefile sample.csv
c1, c2, c3
1, 1.15, one
2, 2.23, two
3, 3.32, three

Writing sample.csv

In [26]:
# 파일로 읽을 때
df = pd.read_csv('sample.csv')
df

   c1    c2      c3
0   1  1.15     one
1   2  2.23     two
2   3  3.32   three

In [27]:
#행삭제를 위해서 df2에 복사
df2 = df[:]

In [29]:
# 1개 행삭제
df2.drop(1, inplace=True)

C:\Users\tjoeun\AppData\Local\Temp\ipykernel_3320\2895365268.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.drop(1, inplace=True)

In [30]:
df2

   c1    c2      c3
0   1  1.15     one
2   3  3.32   three

In [31]:
df3 = pd.DataFrame(np.random.randint(60, 100, 12).reshape(4,3),
                 index=['James', 'maria', 'brian', 'alice'],
                 columns=['kor', 'eng', 'math'])
df3

       kor  eng  math
James   99   65    84
maria   63   88    77
brian   67   92    89
alice   98   66    75

In [32]:
df3.drop('brian', inplace=True)
df3

       kor  eng  math
James   99   65    84
maria   63   88    77
alice   98   66    75

In [33]:
df3.drop(['James', 'alice'], axis=0, inplace=True)
df3

       kor  eng  math
maria   63   88    77

In [141]:
# 열삭제
df4 = pd.DataFrame(np.random.randint(60, 100, 16).reshape(4,4),
                 index=['James', 'maria', 'brian', 'alice'],
                 columns=['kor', 'eng', 'math', 'music'])
df4

       kor  eng  math  music
James   75   60    91     99
maria   75   93    68     61
brian   87   70    60     66
alice   65   97    73     71

In [142]:
df5 = df4.copy()

In [143]:
df5.drop('math', axis=1, inplace=True)
df5

       kor  eng  music
James   75   60     99
maria   75   93     61
brian   87   70     66
alice   65   97     71

In [144]:
df6 = df4.copy()
df6

       kor  eng  math  music
James   75   60    91     99
maria   75   93    68     61
brian   87   70    60     66
alice   65   97    73     71

In [145]:
df6.drop(['eng', 'music'], axis=1, inplace=True)
df6

       kor  math
James   75    91
maria   75    68
brian   87    60
alice   65    73

In [146]:
# select row
# row index를 사용하여 행1개를 선택
mar1 = df4.loc['maria'] #location
print(mar1)

kor      75
eng      93
math     68
music    61
Name: maria, dtype: int32

In [147]:
mar2 = df4.iloc[1] # intger location
print(mar2)

kor      75
eng      93
math     68
music    61
Name: maria, dtype: int32

In [148]:
label = df4.loc[['brian', 'alice']]
label2 = df4.iloc[[2,3]]
label2

       kor  eng  math  music
brian   87   70    60     66
alice   65   97    73     71

In [149]:
# 슬라이싱은 [[A,B]] 대신 [A:B]를 사용한다.
# 범위를 지정하여 행 선택
label2 = df4.loc[['maria', 'brian']]
label3 = df4.loc['maria':'brian']

In [150]:
print(label2)
print(label3)

       kor  eng  math  music
maria   75   93    68     61
brian   87   70    60     66
       kor  eng  math  music
maria   75   93    68     61
brian   87   70    60     66

In [151]:
label4 = df4.iloc[[1, 2]]
label5 = df4.iloc[1:3]
print(label4)
print(label5)

       kor  eng  math  music
maria   75   93    68     61
brian   87   70    60     66
       kor  eng  math  music
maria   75   93    68     61
brian   87   70    60     66

In [152]:
# select columns
math1 = df4['math']
print(type(math1))
print(math1)

<class 'pandas.core.series.Series'>
James    91
maria    68
brian    60
alice    73
Name: math, dtype: int32

In [153]:
# 영어 컬럼 선택 
english = df4.eng
print(type(english))
print(english)

<class 'pandas.core.series.Series'>
James    60
maria    93
brian    70
alice    97
Name: eng, dtype: int32

In [154]:
math_music = df4[['math', 'music']]
print(type(math_music))
print(math_music)

<class 'pandas.core.frame.DataFrame'>
       math  music
James    91     99
maria    68     61
brian    60     66
alice    73     71

In [155]:
math2 = df4[['math']]
print(type(math2))
print(math2)

<class 'pandas.core.frame.DataFrame'>
       math
James    91
maria    68
brian    60
alice    73

In [156]:
# select elements 
# maria 음악점수 가져오기
df4.loc['maria', 'music'] # df.loc[행, 열] 
# df4.iloc[1, 3]

61

In [157]:
# df4.loc['maria', ['eng', 'math']]
df4.iloc[1, [1,2]]

eng     93
math    68
Name: maria, dtype: int32

In [158]:
# james의 영어 수학 음악점수 가져오기 loc와 iloc모두 사용
df4.loc['James', ['eng', 'math', 'music']]
# df4.iloc[0, [1,2,3]]

eng      60
math     91
music    99
Name: James, dtype: int32

In [159]:
# 마리아~엘리스 영어 ~ 음악까지 loc iloc사용 슬라이스
# df4.loc['maria':'alice', 'eng':'music']
df4.iloc[1:4, 1:4]

       eng  math  music
maria   93    68     61
brian   70    60     66
alice   97    73     71

In [160]:
# 열추가 add columns
df4['gym'] = 90 # 없으면 생성하고 있으면 수정
df4

       kor  eng  math  music  gym
James   75   60    91     99   90
maria   75   93    68     61   90
brian   87   70    60     66   90
alice   65   97    73     71   90

In [161]:
# 행추가
df4.loc[4] = 0
df4

       kor  eng  math  music  gym
James   75   60    91     99   90
maria   75   93    68     61   90
brian   87   70    60     66   90
alice   65   97    73     71   90
4        0    0     0      0    0

In [162]:
df4.loc[4] = [30, 30, 30, 40, 40]
df4

       kor  eng  math  music  gym
James   75   60    91     99   90
maria   75   93    68     61   90
brian   87   70    60     66   90
alice   65   97    73     71   90
4       30   30    30     40   40

In [163]:
#1. 행 변경
df4.loc['gildong'] = [23,23,23,23,23]
df4

         kor  eng  math  music  gym
James     75   60    91     99   90
maria     75   93    68     61   90
brian     87   70    60     66   90
alice     65   97    73     71   90
4         30   30    30     40   40
gildong   23   23    23     23   23

In [168]:
df5 = df4.copy()
df5 = df5.reindex(index=['James', 'maria', 'gildong', 'brian', 'alice',  4])

In [169]:
df5

         kor  eng  math  music  gym
James     75   60    91     99   90
maria     75   93    68     61   90
gildong   23   23    23     23   23
brian     87   70    60     66   90
alice     65   97    73     71   90
4         30   30    30     40   40

In [99]:
# 2. concat iloc로 
# 행 중간 삽입 concat함수 iloc 함수 사용
# pd.concat([df.iloc[:n], 원하는행, df.iloc[n:]], ignore_index=True)

NameError: name 'n' is not defined

In [170]:
df6 = df4.copy()

In [174]:
new_row = pd.DataFrame([['aaa', 'bbb', 'ccc', 'ddd', 'fff']],
                       columns = df6.columns)

In [175]:
new_df = pd.concat([df6.iloc[:2], new_row, df6.iloc[2:]], 
                   ignore_index = True)

In [176]:
new_df

   kor  eng math music  gym
0   75   60   91    99   90
1   75   93   68    61   90
2  aaa  bbb  ccc   ddd  fff
3   87   70   60    66   90
4   65   97   73    71   90
5   30   30   30    40   40
6   23   23   23    23   23

In [177]:
# set_index
exam_data = {'이름':['길동', '철수', '영희'],
            '수학': [90, 80, 70], '영어': [98, 89, 95],
            '음악': [85, 95, 100],'체육': [100, 90, 90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  길동  90  98   85  100
1  철수  80  89   95   90
2  영희  70  95  100   90

In [178]:
df.set_index('이름', inplace=True)
print(df)

    수학  영어   음악   체육
이름
길동  90  98   85  100
철수  80  89   95   90
영희  70  95  100   90

In [182]:
#길동의 체육점수
# df.iloc[0][3]
# df.loc['길동', '체육']
df.loc['길동']['체육']

100

In [185]:
#길동의 체육점수 90점으로 수정
df.loc['길동', '체육'] = 90
df

    수학  영어   음악  체육
이름
길동  90  98   85  90
철수  80  89   95  90
영희  70  95  100  90

In [187]:
# 철수 음악 체육을 50점으로 변경
df.loc['철수', ['음악', '체육']] = 50
df

    수학  영어   음악  체육
이름
길동  90  98   85  90
철수  80  89   50  50
영희  70  95  100  90

In [189]:
#  철수의 음악 체육을 100, 50으로 변경
df.loc['철수', ['음악', '체육']] = 100, 50
df

    수학  영어   음악  체육
이름
길동  90  98   85  90
철수  80  89  100  50
영희  70  95  100  90

In [191]:
#전치 transpose()
df.transpose()

이름  길동   철수   영희
수학  90   80   70
영어  98   89   95
음악  85  100  100
체육  90   50   90

In [192]:
df.T

이름  길동   철수   영희
수학  90   80   70
영어  98   89   95
음악  85  100  100
체육  90   50   90

In [198]:
df = df.T
df

이름  길동   철수   영희
수학  90   80   70
영어  98   89   95
음악  85  100  100
체육  90   50   90

In [199]:
df

이름  길동   철수   영희
수학  90   80   70
영어  98   89   95
음악  85  100  100
체육  90   50   90

In [200]:
# set_index 추가사용방법
exam_data = {'이름':['길동', '철수', '영희'],
            '수학': [90, 80, 70], '영어': [98, 89, 95],
            '음악': [85, 95, 100],'체육': [100, 90, 90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  길동  90  98   85  100
1  철수  80  89   95   90
2  영희  70  95  100   90

In [203]:
ndf = df.set_index(['이름'])
ndf

    수학  영어   음악   체육
이름
길동  90  98   85  100
철수  80  89   95   90
영희  70  95  100   90

In [205]:
ndf2 = ndf.set_index('음악')
ndf2

     수학  영어   체육
음악
85   90  98  100
95   80  89   90
100  70  95   90

In [206]:
ndf3 = ndf.set_index(['수학', '음악'])
ndf3

        영어   체육
수학 음악
90 85   98  100
80 95   89   90
70 100  95   90

In [207]:
# reindex  
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9],
            'c3':[10,11,12], 'c4':[13,14,15]}
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [209]:
# 인덱스를 새로 지정해서 행 추가함
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf = df.reindex(new_index)
print(ndf)

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

In [216]:
#reindex로 발생한 NAN값을 0으로 채우기
ndf2 = df.reindex(new_index, fill_value=0)
ndf2

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [217]:
# reset_index
ndf2 = ndf2.reset_index()

In [218]:
ndf2

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15
3    r3   0   0   0   0   0
4    r4   0   0   0   0   0

In [219]:
# 내림차순으로 행 인덱스 정렬
ndf2 = ndf2.sort_index(ascending=False)
print(ndf2)

  index  c0  c1  c2  c3  c4
4    r4   0   0   0   0   0
3    r3   0   0   0   0   0
2    r2   3   6   9  12  15
1    r1   2   5   8  11  14
0    r0   1   4   7  10  13

In [222]:
#열을 c1열을 기준으로 내림차순
ndf3 = ndf2.sort_values(by='c1', ascending=False)
ndf3

  index  c0  c1  c2  c3  c4
2    r2   3   6   9  12  15
1    r1   2   5   8  11  14
0    r0   1   4   7  10  13
4    r4   0   0   0   0   0
3    r3   0   0   0   0   0

In [223]:
# 시리즈 숫자계산
student1 = pd.Series({'국어':100, '영어':80, '수학':90})
print(student1)

국어    100
영어     80
수학     90
dtype: int64

In [226]:
# 과목별로 점수를 200으로 나누기
percentage = student1 / 200
print(percentage)
print(type(percentage))

국어    0.50
영어    0.40
수학    0.45
dtype: float64
<class 'pandas.core.series.Series'>

In [231]:
student1 = pd.Series({'국어':100, '영어':80, '수학':90})
student2 = pd.Series({'수학':80, '국어':90, '영어':80})
# 두학생의 과목별 점수 사칙연산
add1 = student1 + student2 #덧셈
sub = student1 - student2 #뺄셈
mul = student1 * student2 #곱셈
div = student1 / student2 #나눗셈
print(add1, sub, mul, div)

국어    190
수학    170
영어    160
dtype: int64 국어    10
수학    10
영어     0
dtype: int64 국어    9000
수학    7200
영어    6400
dtype: int64 국어    1.111111
수학    1.125000
영어    1.000000
dtype: float64

In [232]:
#사칙연산 겨로가를 데이터 프레임으로 합치기 (series --> 데이터프레임)
result = pd.DataFrame([add1, sub, mul, div], index=['덧셈', '뺄셈', '곱셈', '나눗셈'])
print(result)

              국어        수학      영어
덧셈    190.000000   170.000   160.0
뺄셈     10.000000    10.000     0.0
곱셈   9000.000000  7200.000  6400.0
나눗셈     1.111111     1.125     1.0

In [234]:
#결측치가 있는경우 사칙연산
student1 = pd.Series({'국어':np.nan, '영어':80, '수학':90})
student2 = pd.Series({'수학':80, '국어':90, '영어':80})
# 두학생의 과목별 점수 사칙연산
add2 = student1 + student2 #덧셈
sub2 = student1 - student2 #뺄셈
mul2 = student1 * student2 #곱셈
div2 = student1 / student2 #나눗셈
print(add2, sub2, mul2, div2)

국어      NaN
수학    170.0
영어    160.0
dtype: float64 국어     NaN
수학    10.0
영어     0.0
dtype: float64 국어       NaN
수학    7200.0
영어    6400.0
dtype: float64 국어      NaN
수학    1.125
영어    1.000
dtype: float64

In [235]:
result2 = pd.DataFrame([add2, sub2, mul2, div2], index=['덧셈', '뺄셈', '곱셈', '나눗셈'])
print(result2)

     국어        수학      영어
덧셈  NaN   170.000   160.0
뺄셈  NaN    10.000     0.0
곱셈  NaN  7200.000  6400.0
나눗셈 NaN     1.125     1.0

In [237]:
# 두학생의 과목별 점수 사칙연산(연산메소드 사용)
add3 = student1.add(student2, fill_value=0) #덧셈
sub3 = student1.sub(student2, fill_value=0) #뺄셈
mul3 = student1.mul(student2, fill_value=0) #곱셈
div3 = student1.div(student2, fill_value=0) #나눗셈
print(add3, sub3, mul3, div3)

국어     90.0
수학    170.0
영어    160.0
dtype: float64 국어   -90.0
수학    10.0
영어     0.0
dtype: float64 국어       0.0
수학    7200.0
영어    6400.0
dtype: float64 국어    0.000
수학    1.125
영어    1.000
dtype: float64

In [239]:
import seaborn as sns
# 타이타닉 데이터셋에서 
titanic = sns.load_dataset('titanic')
len(titanic)

891

In [240]:
titanic.head() # 첫 5개 행만 출력

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [241]:
df = titanic.loc[:, ['age', 'fare']]

In [243]:
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [244]:
df.tail() # 마지막 5행 출력

      age   fare
886  27.0  13.00
887  19.0  30.00
888   NaN  23.45
889  26.0  30.00
890  32.0   7.75

In [245]:
new_df = df + 10
new_df

      age     fare
0    32.0  17.2500
1    48.0  81.2833
2    36.0  17.9250
3    45.0  63.1000
4    45.0  18.0500
..    ...      ...
886  37.0  23.0000
887  29.0  40.0000
888   NaN  33.4500
889  36.0  40.0000
890  42.0  17.7500

[891 rows x 2 columns]

In [246]:
#데이터프레임끼리 연산
new_df - df

      age  fare
0    10.0  10.0
1    10.0  10.0
2    10.0  10.0
3    10.0  10.0
4    10.0  10.0
..    ...   ...
886  10.0  10.0
887  10.0  10.0
888   NaN  10.0
889  10.0  10.0
890  10.0  10.0

[891 rows x 2 columns]